InformationRegisters/ГрафикиРаботыПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиРаботыПредприятия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГрафикиРаботыПредприятия/Ext/ManagerModule.bsl
Процедура ЗаполнитьГрафик(ДанныеГрафика) Экспорт 

	Для Каждого СтрокаГрафика Из ДанныеГрафика Цикл 
		ЗаписьДаты = СоздатьМенеджерЗаписи();
		ЗаписьДаты.Дата = СтрокаГрафика.Дата;
		ЗаписьДаты.КоличествоЧасов = СтрокаГрафика.КоличествоЧасов;
		ЗаписьДаты.График = СтрокаГрафика.Ссылка;
		ЗаписьДаты.Записать(Истина);
	КонецЦикла;
	

КонецПроцедуры // ЗаполнитьГрафик()
